{"input": "모든 아티스트 정보 조회. 아티스트 관리 및 분석을 위해 아티스트 ID와 이름 등 기본 정보가 필요할 수 있음.", "query": "SELECT * FROM Artist"}
{"input": "아티스트 이름이 'AC/DC'인 아티스트의 앨범 정보 조회\n\n가능한 비즈니스 및 기능적 목적:\n1. 특정 아티스트의 전체 앨범 목록을 확인하여 음악 라이브러리를 구축하거나 업데이트\n2. 아티스트의 인기 앨범을 파악하여 추천 시스템에 활용\n3. 아티스트의 작품 활동 기간 및 활동량을 파악하기 위한 데이터 수집\n4. 아티스트 관련 콘텐츠나 상품 기획 시 참고 자료로 활용\n\n상세 목적 및 동기:\n이 쿼리는 'AC/DC'라는 아티스트 이름을 가진 아티스트의 고유 ID를 찾아 해당 ID와 연결된 모든 앨범 정보를 조회합니다. 이를 통해 특정 아티스트의 전체 음악 작품 목록을 한눈에 파악할 수 있습니다. 이는 음악 스트리밍 서비스나 온라인 음원 판매 플랫폼에서 아티스트 프로필 페이지를 구성하거나, 아티스트 관련 콘텐츠를 제작할 때 필수적인 정보입니다. 또한 아티스트의 인기 앨범을 파악하여 개인 맞춤 추천 시스템에 활용할 수 있으며, 아티스트의 작품 활동 기간과 활동량을 분석하는 데에도 도움이 됩니다. 나아가 아티스트 관련 상품 기획이나 마케팅 전략 수립 시에도 이 정보를 참고할 수 있습니다.", "query": "SELECT * FROM Album WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'AC/DC')"}
{"input": "특정 장르(락)에 속하는 모든 트랙 정보 조회. 락 음악 장르에 해당하는 트랙들의 상세 정보를 확인하고자 할 때 사용할 수 있는 쿼리. 장르별 트랙 현황을 파악하거나 특정 장르의 트랙 목록을 추출하는 데 활용 가능.", "query": "SELECT * FROM Track WHERE GenreId = (SELECT GenreId FROM Genre WHERE Name = 'Rock')"}
{"input": "모든 트랙의 총 재생 시간 밀리초 단위로 합산하여 조회. 음원 서비스에서 전체 음원 라이브러리의 총 재생 시간을 파악하거나, 특정 장르나 앨범의 총 재생 시간을 분석하는 데 활용 가능. 새로운 음원 추가 시 총 재생 시간 증가분을 모니터링하거나, 스트리밍 서비스 요금 정책 수립 시 총 재생 시간 데이터를 참고할 수 있음.", "query": "SELECT SUM(Milliseconds) FROM Track"}
{"input": "캐나다에 거주하는 고객 정보 조회. 고객 관리 및 맞춤형 서비스 제공을 위해 특정 국가 고객 데이터를 필터링할 수 있음. 마케팅 캠페인이나 프로모션 활동 대상을 지역별로 세분화하거나 현지 규정 준수를 위한 데이터 분석 등 다양한 비즈니스 목적으로 활용 가능.", "query": "SELECT * FROM Customer WHERE Country = 'Canada'"}
{"input": "앨범 ID가 5인 트랙 수 조회. 특정 앨범에 포함된 트랙 수를 파악하여 앨범 구성 현황을 확인하거나 앨범별 트랙 수 통계를 내기 위한 목적으로 사용될 수 있음.", "query": "SELECT COUNT(*) FROM Track WHERE AlbumId = 5"}
{"input": "전체 송장 건수 확인", "query": "SELECT COUNT(*) FROM Invoice"}
{"input": "30만 밀리초 이상 재생 시간을 가진 트랙 정보 조회. 음악 스트리밍 서비스에서 장시간 재생되는 곡들을 파악하여 사용자 청취 패턴 분석 및 장르별 인기 곡 추천에 활용 가능.", "query": "SELECT * FROM Track WHERE Milliseconds > 300000"}
{"input": "고객별 총 구매액을 내림차순으로 정렬하여 상위 5명의 고객 ID와 총 구매액 조회\n\n이 쿼리는 고객 구매 행동 분석, 우수 고객 관리, 마케팅 전략 수립 등의 목적으로 활용될 수 있습니다. 상위 고객들의 구매 패턴과 선호도를 파악하여 맞춤형 프로모션과 서비스를 제공하거나, 고객 유지 및 재구매 유도 전략을 수립하는 데 도움이 됩니다. 또한 매출 기여도가 높은 고객층을 정의하고 타겟팅하는 데도 활용할 수 있습니다.", "query": "SELECT CustomerId, SUM(Total) AS TotalPurchase FROM Invoice GROUP BY CustomerId ORDER BY TotalPurchase DESC LIMIT 5"}
{"input": "전체 직원 수 조회. 이 쿼리는 인력 관리, 인사 계획 수립, 조직 규모 파악 등의 목적으로 사용될 수 있습니다. 회사 전체 직원 수를 파악하여 인력 현황을 모니터링하고, 향후 인력 계획을 수립하거나 조직 구조 조정 시 기초 데이터로 활용할 수 있습니다.", "query": "SELECT COUNT(*) FROM Employee"}
